## Final Project Submission

Please fill out:
* Student name: ELTON MWEMA
* Student pace: self paced / part time / full time
* Scheduled project review date/time: 
* Instructor name: MARK TIBA
* Blog post URL:

# 1.BUSINESS UNDERSTANDING

## 1.1.Business Problem
Microsoft sees all the big companies creating original video content and they want to get in on the fun. They have decided to create a new movie studio, but they don’t know anything about creating movies.I am charged with exploring what types of films are currently doing the best at the box office. i will then translate those findings into actionable insights that the head of Microsoft's new movie studio will use to help decide what type of films to create.

# 2.DATA UNDERSTANDING

## 2.1.Importing relevant libraries

In [1]:
# Your code here - remember to use markdown cells for comments as well!

#importing the relevant files thatt will be needed in this project.
import json
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
import sqlite3

## 2.2.Reading the datasets
Here we look at the datasets and decide on the most relevant to our analysis

In [2]:
Movies = pd.read_csv('tmdb.movies.csv') #Reading the movies file for preview
Movies

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186
...,...,...,...,...,...,...,...,...,...,...
26512,26512,"[27, 18]",488143,en,Laboratory Conditions,0.600,2018-10-13,Laboratory Conditions,0.0,1
26513,26513,"[18, 53]",485975,en,_EXHIBIT_84xxx_,0.600,2018-05-01,_EXHIBIT_84xxx_,0.0,1
26514,26514,"[14, 28, 12]",381231,en,The Last One,0.600,2018-10-01,The Last One,0.0,1
26515,26515,"[10751, 12, 28]",366854,en,Trailer Made,0.600,2018-06-22,Trailer Made,0.0,1
26516,26516,"[53, 27]",309885,en,The Church,0.600,2018-10-05,The Church,0.0,1

In [69]:
#Importing the movies budget data frame using csv
Budget = pd.read_csv('bom.movie_gross.csv')

#calling the first 10 columns of the data frame
y = Budget.head(10)
y

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
5,The Twilight Saga: Eclipse,Sum.,300500000.0,398000000,2010
6,Iron Man 2,Par.,312400000.0,311500000,2010
7,Tangled,BV,200800000.0,391000000,2010
8,Despicable Me,Uni.,251500000.0,291600000,2010
9,How to Train Your Dragon,P/DW,217600000.0,277300000,2010

In [4]:
#connecting to the IM data base through the sql command
conn = sqlite3.connect('im.db')
conn

In [5]:
#calling the specific movie_basics table from the data base
df=pd.read_sql("""SELECT *
               FROM movie_basics;
               """,conn)
df

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,None
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

#  2.3 Exploring the datasets

We are describing these data frames to understand on which sets we can combine to work on

### 2.3.1 Movies dataset

In [6]:
#Dropping the unnamed column as it displays indices which already exist by default

Movies = Movies.drop(['Unnamed: 0'],axis = 1)
Movies

,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186
...,...,...,...,...,...,...,...,...,...
26512,"[27, 18]",488143,en,Laboratory Conditions,0.600,2018-10-13,Laboratory Conditions,0.0,1
26513,"[18, 53]",485975,en,_EXHIBIT_84xxx_,0.600,2018-05-01,_EXHIBIT_84xxx_,0.0,1
26514,"[14, 28, 12]",381231,en,The Last One,0.600,2018-10-01,The Last One,0.0,1
26515,"[10751, 12, 28]",366854,en,Trailer Made,0.600,2018-06-22,Trailer Made,0.0,1
26516,"[53, 27]",309885,en,The Church,0.600,2018-10-05,The Church,0.0,1

In [7]:
#exploring column information on the dataframe

Movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   genre_ids          26517 non-null  object
 1   id                 26517 non-null  int64
 2   original_language  26517 non-null  object
 3   original_title     26517 non-null  object
 4   popularity         26517 non-null  float64
 5   release_date       26517 non-null  object
 6   title              26517 non-null  object
 7   vote_average       26517 non-null  float64
 8   vote_count         26517 non-null  int64
dtypes: float64(2), int64(2), object(5)
memory usage: 1.8+ MB

In [10]:
#Viewing the measures of the Movies dataset

Movies.describe().T

,count,mean,std,min,25%,50%,75%,max
id,26517.0,295050.153260,153661.615648,27.0,157851.0,309581.000,419542.000,608444.000
popularity,26517.0,3.130912,4.355229,0.6,0.6,1.374,3.694,80.773
vote_average,26517.0,5.991281,1.852946,0.0,5.0,6.000,7.000,10.000
vote_count,26517.0,194.224837,960.961095,1.0,2.0,5.000,28.000,22186.000

### 2.3.2 Budget dataset

In [70]:
#We call the general view of the data frame
Budget

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

In [71]:
#We seek the general information of this dataset
Budget.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

### 2.3.2.1 Tidying

we are tidying the budget data set as we notice null values and odd data types that could affect our analysis

In [72]:
#Checking the number of null values per column
Budget.isna().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [73]:
#We drop all the null value columns in our data frame as the number is insignificant to our analysis

Budget = Budget.dropna()

In [74]:
#Checking the state of out dataset to see if its tidy

Budget.isna().sum()

title             0
studio            0
domestic_gross    0
foreign_gross     0
year              0
dtype: int64

In [63]:
#Here we change the data types we feel are inconsistent with our aim

#Budget['foreign_gross'] = Budget.loc[:'foreign_gross'].astype(int)
#Budget['year'] = Budget.loc[:'year'].astype(object)

In [64]:
#Budget.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2007 entries, 0 to 3353
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           2007 non-null   object
 1   studio          2007 non-null   object
 2   domestic_gross  2007 non-null   float64
 3   foreign_gross   2007 non-null   object
 4   year            2007 non-null   object
dtypes: float64(1), object(4)
memory usage: 174.1+ KB

In [75]:
#Describing the clean data set
Budget.describe().T

,count,mean,std,min,25%,50%,75%,max
domestic_gross,2007.0,4.701984e+07,8.162689e+07,400.0,670000.0,16700000.0,56050000.0,936700000.0
year,2007.0,2.013506e+03,2.597997e+00,2010.0,2011.0,2013.0,2016.0,2018.0

# 3. Data preparation

After having the relevant information about the Data sets,i have decided to use two of them by merging.
They are the movies dataset and the Budget dataset as the contain all relevant questions

## 3.1 Selecting and Merging

We merge the two dataset that have been decided on

In [76]:
#The merge() function is used and the resultant dataset is larger and more relevant

data_set = Movies.merge(Budget ,how = 'inner',on = 'title')
data_set.head()

,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count,studio,domestic_gross,foreign_gross,year
0,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610,P/DW,217600000.0,277300000,2010
1,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368,Par.,312400000.0,311500000,2010
2,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186,WB,292600000.0,535700000,2010
3,"[16, 10751, 35]",10193,en,Toy Story 3,24.445,2010-06-17,Toy Story 3,7.7,8340,BV,415000000.0,652000000,2010
4,"[16, 10751, 35]",20352,en,Despicable Me,23.673,2010-07-09,Despicable Me,7.2,10057,Uni.,251500000.0,291600000,2010

In [77]:
#We check on the general outlook of our data 
data_set.tail()

,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count,studio,domestic_gross,foreign_gross,year
1696,"[12, 80, 10751, 35]",425148,en,Show Dogs,7.904,2018-05-18,Show Dogs,5.9,92,Global Road,17900000.0,21300000,2018
1697,"[35, 10749, 18, 9648]",522921,zh,超时空同居,6.840,2018-05-17,How Long Will I Love U,7.4,11,WGUSA,747000.0,82100000,2018
1698,"[12, 35, 14]",497984,zh,捉妖记2,6.637,2018-02-14,Monster Hunt 2,6.3,14,LGF,706000.0,361000000,2018
1699,"[18, 10749]",446132,fr,Gauguin: Voyage de Tahiti,5.553,2018-07-11,Gauguin: Voyage to Tahiti,5.6,48,Cohen,200000.0,3100000,2018
1700,"[28, 12, 16]",332718,en,Bilal: A New Breed of Hero,2.707,2018-02-02,Bilal: A New Breed of Hero,6.8,54,VE,491000.0,1700000,2018

## 3.2 Data cleaning

### 3.2.1 Uniformity

In [78]:
# General information of the dataset
data_set.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1701 entries, 0 to 1700
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   genre_ids          1701 non-null   object
 1   id                 1701 non-null   int64
 2   original_language  1701 non-null   object
 3   original_title     1701 non-null   object
 4   popularity         1701 non-null   float64
 5   release_date       1701 non-null   object
 6   title              1701 non-null   object
 7   vote_average       1701 non-null   float64
 8   vote_count         1701 non-null   int64
 9   studio             1701 non-null   object
 10  domestic_gross     1701 non-null   float64
 11  foreign_gross      1701 non-null   object
 12  year               1701 non-null   int64
dtypes: float64(3), int64(3), object(7)
memory usage: 186.0+ KB

### 3.2.2 Completeness

In [79]:
#Checking for null values,if all ==0,out set is complete.
data_set.isna().sum()

genre_ids            0
id                   0
original_language    0
original_title       0
popularity           0
release_date         0
title                0
vote_average         0
vote_count           0
studio               0
domestic_gross       0
foreign_gross        0
year                 0
dtype: int64

### 3.2.3 Consistency

In [80]:
#We use the duplicated method to check the consistency of our data
data_set.duplicated().sum()

125

In [85]:
#We drop the duplicated columns
data_set = data_set.drop_duplicates()

In [86]:
#We confirm that we have dropped all duplicated rows and the result should be zero
data_set.duplicated().sum()

0

### 3.2.4 Validity

In [97]:
#We drop irrelevant columns
data_set = data_set.drop('genre_ids', axis = 1)
data_set = data_set.drop('original_title', axis = 1)
data_set

,id,original_language,popularity,release_date,title,vote_average,vote_count,studio,domestic_gross,foreign_gross,year
0,10191,en,28.734,2010-03-26,How to Train Your Dragon,7.7,7610,P/DW,217600000.0,277300000,2010
1,10138,en,28.515,2010-05-07,Iron Man 2,6.8,12368,Par.,312400000.0,311500000,2010
2,27205,en,27.920,2010-07-16,Inception,8.3,22186,WB,292600000.0,535700000,2010
3,10193,en,24.445,2010-06-17,Toy Story 3,7.7,8340,BV,415000000.0,652000000,2010
4,20352,en,23.673,2010-07-09,Despicable Me,7.2,10057,Uni.,251500000.0,291600000,2010
...,...,...,...,...,...,...,...,...,...,...,...
1696,425148,en,7.904,2018-05-18,Show Dogs,5.9,92,Global Road,17900000.0,21300000,2018
1697,522921,zh,6.840,2018-05-17,How Long Will I Love U,7.4,11,WGUSA,747000.0,82100000,2018
1698,497984,zh,6.637,2018-02-14,Monster Hunt 2,6.3,14,LGF,706000.0,361000000,2018
1699,446132,fr,5.553,2018-07-11,Gauguin: Voyage to Tahiti,5.6,48,Cohen,200000.0,3100000,2018
1700,332718,en,2.707,2018-02-02,Bilal: A New Breed of Hero,6.8,54,VE,491000.0,1700000,2018

# 4. Analysis
Here we make usefullness of ur cleaned data set through visual insights and other descriptive sttistics

In [98]:
#Viewing the dataset overal information
data_set.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1576 entries, 0 to 1700
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 1576 non-null   int64
 1   original_language  1576 non-null   object
 2   popularity         1576 non-null   float64
 3   release_date       1576 non-null   object
 4   title              1576 non-null   object
 5   vote_average       1576 non-null   float64
 6   vote_count         1576 non-null   int64
 7   studio             1576 non-null   object
 8   domestic_gross     1576 non-null   float64
 9   foreign_gross      1576 non-null   object
 10  year               1576 non-null   int64
dtypes: float64(3), int64(3), object(5)
memory usage: 147.8+ KB

In [51]:
#We are getting the count of the movie languages most produced by the studios
data_set['original_language'].unique()
x = data_set['original_language'].value_counts()
x

en    2154
fr     125
hi      61
zh      51
es      45
ja      38
ko      29
de      25
no      18
it      16
cn      15
ru      13
he      13
da      12
pt      11
sv      10
ro       8
nl       7
th       5
el       5
pl       5
ar       4
hu       4
fa       4
ta       4
uk       3
is       3
tr       3
te       1
tl       1
et       1
lt       1
ca       1
vi       1
id       1
mi       1
fi       1
eu       1
ka       1
xx       1
Name: original_language, dtype: int64